パフォーマンスチーム
========

チーム概要
----------
コンピュータ分野においてパフォーマンス（性能）とは多くの場合は処理速度，計算スピードを意味します．このパフォーマンスチームが目標とするのは計算の高速化です．同じ内容の計算であっても，使用する計算機によって，プログラムの書き方によって実行時間が大きく異なります．特に近年の計算機に搭載されるプロセッサは複雑になってきて，その特徴を理解した上で適したコーディングを行い，そのプロセッサが本来備える性能を引き出す手法を研究するのがこのパフォーマンスチームです．



研究内容
--------
GPU(Graphics Processing Unit)は名前の通り画像処理を担当するデバイスです．３次元空間の可視化等の処理がコンシューマ向けでは３Ｄビデオゲーム，プロ向けではＣＡＤのような設計分野等で利用されています．特にゲーム業界の需要によって，より綺麗で高解像度，高フレームレートの描画を実現できるGPUが必要となり，高性能なデバイスが比較的低価格で提供されるようになりました．その結果として浮動小数演算性能として当時のCPUを上回るようになり，GPUを利用して一般的な計算の高速化の試みがはじまりました．

GPUの特徴は非常に多数の演算器を搭載することです．画像処理が多数のデータに対して同じ計算を行うことから，より多くの演算器を搭載することを優先しています．その代わりに普通のCPUが備える色々な機能を省略したり犠牲にしたりしています．GPUの動作周波数もCPUより低く，多数の演算器を活用できるだけの並列性がなければ高速化が実現できません．目的となる計算内容をうまくGPUの構造に当てはめるにはどのようにプログラムを作成すればよいかを研究していきます．

来年度配属学生の研究テーマとしてはこのGPU計算関係を予定しています．ある計算内容を対象にGPUを使って高速化を行うのがメインになるでしょう．GPU計算を支援する各種ソフトウェア開発も重要なテーマですし，あるいは希望があればGPU以外のCPUやメニーコアプロセッサも対象とします．

<img src="./perfteam-bookshelf.png"></img>

私がGPU計算を始めたのは2007年11月頃．NVIDIA社製GPU向けのCUDAというプログラム開発環境の初の安定版といえるバージョン1.0がリリースされたころでした．それ以降ずっとGPU計算に関わる研究を続けてきました．物理的な書籍はあまり保有しない主義なので本棚はすっきりしています．３冊同じのがあるのが自身の書籍（青木先生と共著）で，日本で初めてのCUDAプログラミングの書籍です．他もほとんどGPU関連ですね．



メンバー
--------

| <span style="display: inline-block; width: 6em;">名前</span> | <span style="display: inline-block; width: 5em;">職階</span> | 研究内容・メッセージ |
|:-----|---|:-------------------------|
|[額田 彰](https://www.hpcs.cs.tsukuba.ac.jp/~nukada/index-j.html)|教授|<font color="green">高性能計算（ハイパフォーマンスコンピューティング），性能最適化，GPUコンピューティング</font><br>私自身は計算の高速化に関連することであれば割と何でもやります．|

立ち上がったばかりのチームですのでまだ学生はいません．配属される皆さんと色々決めていきたいと思います．


<!--
近年の研究成果について
----------------------
-->



